app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def showall
    @items = Item.all

SELECT "items".* FROM "items" WHERE ("items"."id" = 1) LIMIT 1
---
  def show
    @item = Item.find(params[:id])

SELECT "items".* FROM "items" WHERE ("items"."id" = 1) LIMIT 1
---
  def edit
    @item = Item.find(params[:id])

INSERT INTO "items" ("created_at", "description", "photo", "price", "title", "updated_at") VALUES ('2010-11-09 20:33:29.368699', 'Еееебббжджж', 'http://ymamy.ru/images/product/big/h1.jpg', 111, 'Дыня', '2010-11-09 20:33:29.368699')
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE ("items"."id" = 1) LIMIT 1
UPDATE "items" SET "description" = 'Яркие брызги солнечных лепестков с темной сердцевинкой в нежном шоколаде легкой обертки - вот сладкий вкус лета, солнечный, теплый, манящий, словно трюфель из далекого детства… ', "price" = 1550, "title" = 'Букет из подсолнухов', "updated_at" = '2010-11-09 21:05:53.138082' WHERE ("items"."id" = 1)
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])

SELECT "items".* FROM "items" WHERE ("items"."id" = 4) LIMIT 1
DELETE FROM "items" WHERE ("items"."id" = 4)
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy