app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])
    @order.item_id = params[:item_id]



    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("adress", "created_at", "date", "email", "item_id", "name", "phone", "recievername", "recieverphone", "text", "updated_at") VALUES ('sdfdsf', '2010-11-11 17:59:31.780586', '2010-11-11', 'guanxsi@gmail.com', NULL, 'Илья ', '9268133389', 'sdfsdf', '9268133389', 'sdfsdf', '2010-11-11 17:59:31.780586')